[
    {
        "text": "You can crack EVERY DSA interview\nWith this 4-month roadmap (personally used this for Google & Microsoft) 🔻\n☑️ 𝐖𝐞𝐞𝐤 𝟏-𝟐: 𝐀𝐫𝐫𝐚𝐲𝐬, 𝐒𝐭𝐫𝐢𝐧𝐠𝐬, 𝐌𝐚𝐭𝐡 – Prefix sum, sliding window, two pointers, hashing\n☑️ 𝐖𝐞𝐞𝐤 𝟑-𝟒: 𝐋𝐢𝐧𝐤𝐞𝐝 𝐋𝐢𝐬𝐭, 𝐒𝐭𝐚𝐜𝐤, 𝐐𝐮𝐞𝐮𝐞 – Singly/doubly LL, fast-slow pointers, stack with min/max, queue variations\n☑️ 𝐖𝐞𝐞𝐤 𝟓: 𝐓𝐫𝐞𝐞𝐬 & 𝐁𝐢𝐧𝐚𝐫𝐲 𝐓𝐫𝐞𝐞𝐬 – Preorder/Inorder/Postorder, BFS/DFS, diameter, balanced trees\n☑️ 𝐖𝐞𝐞𝐤 𝟔: 𝐁𝐒𝐓 & 𝐓𝐫𝐢𝐞𝐬 – Floor/Ceil, kth smallest, delete in BST, prefix search\n☑️ 𝐖𝐞𝐞𝐤 𝟕: 𝐑𝐞𝐜𝐮𝐫𝐬𝐢𝐨𝐧 & 𝐁𝐚𝐜𝐤𝐭𝐫𝐚𝐜𝐤𝐢𝐧𝐠 – Subsets, permutations, N-Queens, Sudoku solver\n☑️ 𝐖𝐞𝐞𝐤 𝟖: 𝐇𝐞𝐚𝐩𝐬 & 𝐏𝐫𝐢𝐨𝐫𝐢𝐭𝐲 𝐐𝐮𝐞𝐮𝐞 – Median of stream, Top K elements, custom comparator\n☑️ 𝐖𝐞𝐞𝐤 𝟗: 𝐆𝐫𝐚𝐩𝐡𝐬 (𝐁𝐅𝐒, 𝐃𝐅𝐒) – Detect cycle, connected components, bipartite, topological sort\n☑️ 𝐖𝐞𝐞𝐤 𝟏𝟎: 𝐆𝐫𝐚𝐩𝐡𝐬 (𝐀𝐝𝐯𝐚𝐧𝐜𝐞𝐝) – Dijkstra, Prim’s, Kruskal’s, Union Find, shortest path variants\n☑️ 𝐖𝐞𝐞𝐤 𝟏𝟏: 𝐃𝐲𝐧𝐚𝐦𝐢𝐜 𝐏𝐫𝐨𝐠𝐫𝐚𝐦𝐦𝐢𝐧𝐠 – 1D DP (Linear DP), 2D/Matrix DP, DP on Strings, Subsequences, Bitmask DP, Trees, Graphs, Interval DP, MCM Problems, Game Theory DP\nLearning DSA is one thing; using it in interviews is another. Can you stay calm under pressure? Can you tackle follow-up questions and explain your approach step by step?\n📌 The best way to master this is to practice with senior engineers who've actually been on interview panels.\nConnect with them here and get started for FREE: https://lnkd.in/d_dDh4GB\nThey know exactly what the interview process looks like and will guide you with a tailored DSA roadmap, share company-specific questions, provide feedback through mock sessions, and keep you on track. 💫\nhashtag#dsainterviews hashtag#dsastrategy hashtag#collab hashtag#preplacedcollab hashtag#techinterviews hashtag#codingrounds",
        "engagement": 1332,
        "line_count": 12,
        "language": "English",
        "tags": [
            "Interviews",
            "Collaboration",
            "Strategy",
            "Coding"
        ]
    },
    {
        "text": "Kanerika Townhall Q1, 2025 – A New Chapter of Excellence! 🚀\n\nWhat an electrifying start to 2025! Our Q1 Townhall was a powerful reminder of the amazing talent and passion driving Kanerika forward.\n\n💥A huge round of applause to all the nominees and winners! 🏆\nYour exceptional contributions are shaping our future. Whether it’s through innovative ideas, consistent hard work, or inspiring leadership, each of you is a key player in our success. 🙌\n\nTogether, we’ve set the bar high, and we’re just getting started. Let’s keep the momentum going—onwards and upwards! 💡\n\nhashtag#KanerikaExcellence hashtag#Q12025 hashtag#CelebratingSuccess hashtag#Innovation hashtag#Teamwork hashtag#Winners hashtag#ProudMoment\n\nBhupendra Chopra Samidha Garud Vish Nath Majd Madina Amit Chandak Gaurav Verma Ruba D. Cdr Manpreet Singh (Retd) Ryan Palm Dr. Kshitij Singhal Ubedulla Shariff Mohamamd Sunil Allada Naren Ch Amit Kumar Jena Sarika Kothakonda Nandini M",
        "engagement": 81,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Success",
            "Teamwork",
            "Innovation",
            "Quarterly Goals",
            "Excellence"
        ]
    },
    {
        "text": "🕵️‍♂️\n\n“𝐘𝐨𝐮𝐫 𝐫𝐞𝐬𝐮𝐦𝐞 𝐰𝐚𝐬 𝐯𝐢𝐞𝐰𝐞𝐝 𝐛𝐲 𝐉𝐨𝐡𝐧 𝐃𝐨𝐞 𝐨𝐧 𝐅𝐞𝐛 𝟭𝟒, 𝟮𝟬𝟮𝟱 𝐚𝐭 𝟭𝟬:𝟒𝟮 𝐀𝐌.”\n\nWhat if you could get a notification every time someone opened your resume?\nNo more wondering. No more guessing. Just actual signals.\n\nA few months ago, I was deep in the job hunt hustle. I reached out like crazy to managers, HRs, talent acquisition teams, alumni, friends-of-friends... you name it. Sent out dozens of resumes every single day.\n\nBut here's the thing 🤔:\nI had no idea who actually opened them. No idea who was just ghosting me,\nand who might’ve actually taken a look.\nThat’s when I built Visly 👀.\n\n🔍𝐖𝐡𝐚𝐭 𝐢𝐬 𝐕𝐢𝐬𝐥𝐲?\nVisly is a Chrome Extension that shows you who checked out your resume and when. So you can follow up with the people who actually showed interest. No more guessing. No more hoping someone might have seen it.\n\n⚙️ 𝐇𝐨𝐰 𝐢𝐭 𝐰𝐨𝐫𝐤𝐬 :\n1️⃣ Highlight someone’s name (e.g. on LinkedIn)\n2️⃣ Click the “📎 Copy Link” button (a unique, trackable resume link is copied)\n3️⃣ Send the link and get notified when they view your resume (name + date + time)\n\nIt’s lightweight, free, and built to make job hunting a little less blind. 👀\n👨‍💻 Check it out here:\n🔗 https://lnkd.in/dJ5-FG9K\n\nDo give it a try and tell me how it goes 🚀\n\nhashtag#jobsearch hashtag#visly hashtag#resume hashtag#chromeextension hashtag#jobhunt hashtag#studentlife hashtag#recruiting hashtag#career hashtag#resumetips hashtag#techtools hashtag#linkedin hashtag#opensource hashtag#joblife hashtag#applyforjobs hashtag#internships hashtag#coldreach hashtag#connect",
        "engagement": 435,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Networking",
            "Student Life",
            "Career",
            "Recruitment",
            "Social Media",
            "Job Search",
            "Design",
            "Internship",
            "Connection",
            "Technology",
            "Open Source",
            "Resume"
        ]
    },
    {
        "text": "🌟 Excited to Share! 🌟\n\nI am thrilled to announce that I have joined Kanerika Inc as a Software Engineer Intern —a global consulting firm dedicated to building efficient enterprises through automation.\n\nI am truly honored and excited to be a part of this prestigious organization.\n\nA heartfelt thank you to my family and friends for their unwavering support throughout my journey. 🙏\n\nI also want to express my gratitude to the entire Kanerika Inc team for the warm welcome and smooth onboarding process:\nSamidha Garud\nBhupendra Chopra\nJitsoma Banerjee\nAmit Kumar Jena\nNandini Kanumuri\nRoshini Singh\nSai Keerthi Adikarla\n\nA special thanks to Vishal Pandey and Ayushman Tiwari for always supporting me and guiding me in the right direction.\n\nHere’s to growth and the beginning of an exciting new journey! 🚀",
        "engagement": 246,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Career Growth",
            "Software Engineering",
            "Job Search",
            "Company",
            "Internship"
        ]
    },
    {
        "text": "My best friend just left Google </3\n\n17th April 2024: It was my 3rd day at Google when I met Divyam. My first impression of him was that of a quiet, shy guy who’d keep to himself, do his job and head home.\n\nBut first impressions can often be deceiving.\n\nIn just a few weeks, I heard him speak eloquently in meetings, simplifying complex ideas in a way that everyone understood — even new joiners.\n\nI would go on to interact with him and find out how much we had in common— from table tennis to gym to discussing our same-same taste in cricket and anime. We went from colleagues to buddies in no time.\n\nProfessionally, this guy didn’t just do his job — he excelled. Divyam was promoted at Google in less than 1.5 years, which for those who know, is basically the top 1% of the top 1%. Calling him a high performer would be an understatement.\n\nOn top of that, he helped almost everyone on the team, growing like mad in terms of both programming and soft skills - from small talk to deep tech discussions - I witnessed firsthand how a 10x engineer works.\n\nNow, you might be curious: why did he leave even though he was having a blast of a career at Google?\n\nThe answer is simple - having extended the boundaries of what it means to be an engineer so quickly - Divyam realized he’s meant for something bigger (you’d realize the same if you talked to him just once).\n\nWith that, I am elated to tell you all that a 10x engineer (who’s growing more every day) just landed on the market:\n\n- Companies who are looking for top talent in ML - this is your chance, pay whatever it takes to hire him.\n\n- Founders looking for a tech co-founder, this is your shot, pitch him with all you've got.\n\n- VCs looking for a sure bet, this man already has two cool apps out with 10K+ downloads, and is always tinkering. Go chat with him and fund whatever idea he works on next.\n\nYou will thank me later if you get him!\n\n---\n\nDivyam, you’re one of the best.\n\nIt was nothing short of an honor to have worked and have so much fun — outings/meetups/memories outside office with you. And while I plan to annoy you for a long time, not seeing you in office would surely sting.\n\nYou’ll be missed, my friend :')\n\n💙❤️💛💚",
        "engagement": 1577,
        "line_count": 43,
        "language": "English",
        "tags": [
            "Machine Learning",
            "Talent",
            "Leadership",
            "Career",
            "Innovation",
            "Technology",
            "Engineering"
        ]
    },
    {
        "text": "I have been working with React.js for years and now I have finally cracked the code:\n\nHere are 10 React.js LLD questions you should definitely prepare for to make a switch to top PBCs:\n\n𝟭. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗱𝗲𝘀𝗶𝗴𝗻 𝗮 𝘁𝗼𝗮𝘀𝘁 𝗻𝗼𝘁𝗶𝗳𝗶𝗰𝗮𝘁𝗶𝗼𝗻 𝘀𝘆𝘀𝘁𝗲𝗺 𝗶𝗻 𝗥𝗲𝗮𝗰𝘁?\n→ How will you manage global state, queue notifications, and prevent overlaps? Would you use Context, Redux, or a custom event bus?\n\n𝟮. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗯𝘂𝗶𝗹𝗱 𝗮 𝗻𝗲𝘀𝘁𝗲𝗱 𝗰𝗼𝗺𝗺𝗲𝗻𝘁 𝘁𝗵𝗿𝗲𝗮𝗱 𝗹𝗶𝗸𝗲 𝗥𝗲𝗱𝗱𝗶𝘁?\n→ How will you structure recursive components and optimize performance?\n\n𝟯. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗱𝗲𝘀𝗶𝗴𝗻 𝗮 𝗿𝗲𝘀𝗽𝗼𝗻𝘀𝗶𝘃𝗲 𝘀𝗶𝗱𝗲𝗯𝗮𝗿 𝗻𝗮𝘃𝗶𝗴𝗮𝘁𝗶𝗼𝗻?\n→ What’s your approach for mobile vs desktop, toggling submenus, and linking routes?\n\n𝟰. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗶𝗺𝗽𝗹𝗲𝗺𝗲𝗻𝘁 𝗮 𝘁𝗮𝗯 𝗰𝗼𝗺𝗽𝗼𝗻𝗲𝗻𝘁 𝘄𝗶𝘁𝗵 𝗮𝗻𝗶𝗺𝗮𝘁𝗶𝗼𝗻𝘀?\n→ How do you manage tab state, dynamic rendering, and apply smooth transitions?\n\n𝟱. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗯𝘂𝗶𝗹𝗱 𝗮 𝗳𝗶𝗹𝘁𝗲𝗿𝗮𝗯𝗹𝗲, 𝘀𝗼𝗿𝘁𝗮𝗯𝗹𝗲 𝗱𝗮𝘁𝗮 𝘁𝗮𝗯𝗹𝗲 𝗶𝗻 𝗥𝗲𝗮𝗰𝘁?\n→ How do you modularize headers, handle pagination, and manage large datasets?\n\n𝟲. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗶𝗺𝗽𝗹𝗲𝗺𝗲𝗻𝘁 𝗮 '𝗹𝗶𝗸𝗲' 𝗯𝘂𝘁𝘁𝗼𝗻 𝘄𝗶𝘁𝗵 𝗼𝗽𝘁𝗶𝗺𝗶𝘀𝘁𝗶𝗰 𝘂𝗽𝗱𝗮𝘁𝗲𝘀?\n→ How do you update the UI instantly and handle rollbacks on failure?\n\n𝟳. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗯𝘂𝗶𝗹𝗱 𝗮 𝗹𝗶𝘃𝗲 𝗰𝗵𝗮𝘁 𝗳𝗲𝗮𝘁𝘂𝗿𝗲 𝗶𝗻 𝗥𝗲𝗮𝗰𝘁?\n→ Would you use WebSockets or polling? How do you manage messages and typing indicators?\n\n𝟴. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝘁𝗵𝗿𝗼𝘁𝘁𝗹𝗲 𝗼𝗿 𝗱𝗲𝗯𝗼𝘂𝗻𝗰𝗲 𝗯𝘂𝘁𝘁𝗼𝗻 𝗰𝗹𝗶𝗰𝗸𝘀 𝘁𝗼 𝗮𝘃𝗼𝗶𝗱 𝗔𝗣𝗜 𝘀𝗽𝗮𝗺?\n→ Would you use lodash? Or write custom logic?\n\n𝟵. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗶𝗺𝗽𝗹𝗲𝗺𝗲𝗻𝘁 𝗮 𝗰𝗼𝗹𝗹𝗮𝗽𝘀𝗶𝗯𝗹𝗲 𝗮𝗰𝗰𝗼𝗿𝗱𝗶𝗼𝗻 𝗰𝗼𝗺𝗽𝗼𝗻𝗲𝗻𝘁?\n→ Will you allow multiple sections to open? How will you manage transitions?\n\n𝟭𝟬. 𝗛𝗼𝘄 𝘄𝗼𝘂𝗹𝗱 𝘆𝗼𝘂 𝗶𝗺𝗽𝗹𝗲𝗺𝗲𝗻𝘁 𝗱𝗮𝗿𝗸/𝗹𝗶𝗴𝗵𝘁 𝗺𝗼𝗱𝗲 𝘁𝗵𝗲𝗺𝗶𝗻𝗴 𝗶𝗻 𝗮 𝗥𝗲𝗮𝗰𝘁 𝗮𝗽𝗽?\n→ Would you use CSS variables, Context API, or a library?\n\nIf you're aiming for MAANG or top product companies, don’t skip LLD as an afterthought. It is where good React devs become great designers.\n\nAnd if you need a structured routine, you can check out Bosscoder Academy for their personalized mentorship and interview-backed LLD prep.\n\nCheck them out: https://bit.ly/4igJQO0\nThey have helped 2200+ SDEs crack top product-based companies.\n\nIf you found it helpful please do like and share 👍",
        "engagement": 363,
        "line_count": 63,
        "language": "English",
        "tags": [
            "Education",
            "Software Engineering",
            "Leadership",
            "Company",
            "Development",
            "Business",
            "Programming"
        ]
    },
    {
        "text": "🚨 We’re Hiring – Senior Finance Executive at Kanerika! 🚨\n\nAre you well-versed in US Accounting, Taxation, and Compliance? Or do you know someone who is?\n\nWe at Kanerika Inc are on the lookout for a skilled and driven Senior Finance Executive to join our growing team!\n🔹 Strong knowledge of US financial regulations\n🔹 Experience in accounting, taxation & compliance\n🔹 Detail-oriented and analytical mindset\n\nIf this sounds like you (or someone you know), we’d love to connect!\n\n📩 Apply now or share this post to help us reach the right talent.\nLet’s build something great together!\n\n#Hiring #FinanceJobs #USAccounting #Compliance #Taxation #KanerikaCareers #JobOpportunity #NowHiring #SeniorFinanceExecutive #USGAAP #Opening #Hyderabadjobs #Careeropportunity #Apply #Kanerika",
        "engagement": 14,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Accounting",
            "Compliance",
            "Career",
            "Taxation",
            "Job Search",
            "Finance"
        ]
    },
    {
        "text": "💔 6 Months Without Work — But Not Without Hope 🙏\nI never thought I’d have to write a post like this — but today, I’m choosing courage over silence, and hope over fear.\nWith 7 years of experience as a QA Engineer, I’ve had the privilege to work with top companies like Unacademy, CARS24, CarDekho Group, SCIENTIFIC GAMES, Light & Wonder, and RELIGARE HEALTH INSURANCE (RHI) Health Insurance (now Care Health Insurance).\nMy domain experience spans across EdTech, Automobile, Health Insurance, and iGaming, giving me a well-rounded view of product and user quality.\n\nI specialize in:\n✅ Manual Testing\n✅ API Testing using Postman\n✅ JIRA, Agile Methodologies\n✅ MySQL Database\n\nCurrently, I’m also upskilling in Automation Testing — learning Selenium with Java from Uncodemy, to stay ahead and expand my capabilities.\n\nBut for the past 6 months, I’ve been unemployed, and I’ll be honest — it’s been tough.\nLiving in Bangalore without a job is not easy, especially as someone who comes from a small village in Bihar, where girls aren’t often encouraged to pursue education.\nBeing a part of middle-class family background I broke through that barrier, completed my education, and became the first in my family to do so — carrying the responsibility of being the eldest daughter and main supporter for my family. My parents always supported me being a farmer and homemaker, now I'm feeling guilty that I'm not capable to support back to them.\n\nDespite the current financial and emotional stress, I haven’t lost hope.\n✨ I'm actively looking for a role in:\n#QAManual\n#ScrumMaster\n#AssociateProductManager (APM)\n\nI believe my experience, adaptability, and dedication make me a strong candidate — and I am an IMMEDIATE JOINER, ready to contribute from Day 1.\nIf you or someone you know is hiring, please consider my profile or help me by sharing this post. Even a small action could mean a world of change.\n📩 Feel free to DM me for my resume or any details. Thank you so much for your support!\n\nLet’s remember — behind every job title is a person with dreams, struggles, and the will to rise again.",
        "engagement": 444,
        "line_count": 26,
        "language": "English",
        "tags": [
            "Education",
            "Gaming",
            "Product Management",
            "Project Management",
            "Health Insurance",
            "Database",
            "Testing",
            "Agile",
            "Automotive",
            "Programming"
        ]
    },
    {
        "text": "How I Cracked the Goldman Sachs Engineering Campus Hiring Program (EHCP) Aptitude Test\n\nA lot of folks have reached out asking how I prepared for the aptitude test that comes before the Goldman Sachs EHCP interviews.\n\nSo here’s the breakdown:\n\nTo reach the interview stage, I first had to clear two rounds of online assessments:\n1. Aptitude Test\n2. Technical Test\n\nWhile preparing for the aptitude test, I stumbled upon a goldmine of a YouTube playlist that broke down all the different question patterns in detail.\nI focused on mastering the patterns shown in those videos—and honestly, it worked! I was able to solve most of the questions confidently.\n\nYouTube playlist: https://lnkd.in/gkNYSVNR\n\n⚠️ Disclaimer:\nI took this test in Oct-Nov 2022. The format might have changed since then—please verify the latest structure before you start preparing.\n\nHere’s what the format of the Aptitude Test looked like (as of 2022):\n• Total Time: 120 minutes\n• Total Questions: 70\n• Sections: 7 (all mandatory & video proctored)\n• You could switch between sections.\n\nSections:\n• Numerical Computations — 12 Qs\n• Numerical Reasoning — 12 Qs\n• Abstract Reasoning — 12 Qs\n• Diagrammatic Reasoning — 12 Qs\n• Logical Reasoning — 12 Qs\n• Comprehension 1 — 5 Qs\n• Comprehension 2 — 5 Qs\n\nMarking Scheme:\n+5 for every correct answer\n-2 for every incorrect one\n\nHope this helps, I’ll soon share the details of my Technical Test experience.",
        "engagement": 272,
        "line_count": 23,
        "language": "English",
        "tags": [
            "Finance",
            "Health",
            "Assessment",
            "Job Search"
        ]
    },
    {
        "text": "𝐈𝐧 𝟐𝟎𝟐𝟓, 𝐬𝐨𝐥𝐯𝐢𝐧𝐠 𝟏𝟎𝟎𝟎+ 𝐋𝐞𝐞𝐭𝐂𝐨𝐝𝐞 𝐪𝐮𝐞𝐬𝐭𝐢𝐨𝐧𝐬 ≠ 𝐚 𝐣𝐨𝐛 𝐨𝐟𝐟𝐞𝐫.\n\nIf I had to start over today and crack a software engineering job as a student, here’s the roadmap I’d follow:\n\n► Phase 1: Build Your Foundations\n1. 𝐃𝐒𝐀 𝐅𝐢𝐫𝐬𝐭 – Start with core topics: Arrays, Strings, Linked Lists, Stacks, Queues\nPlatforms: GeeksforGeeks, HackerRank, LeetCode (focus on Easy/Medium)\n2. 𝐂𝐨𝐫𝐞 𝐂𝐒 𝐒𝐮𝐛𝐣𝐞𝐜𝐭𝐬 – Learn in parallel:\n• Operating Systems – Memory management, scheduling, deadlocks\n• DBMS – SQL queries, transactions, indexing\n• Computer Networks – TCP/IP, HTTP, DNS\n• OOPs – Inheritance, polymorphism, design patterns\n\nFor a long time, I believed: the more I grind, the better I get.\nBut then I came across an SDE-3 at Microsoft who cracked it with under 400 problems.\nThat completely shifted my perspective.\n\nIt’s not about solving 1000+ questions.\nIt’s about solving the right ones, recognizing patterns, and building real clarity.\n\nRecently, I discovered Pratik Kapasi (ex-Google coach), who has compiled 127 key patterns that cover almost every tricky FAANG-level question.\nNow he’s offering a free 1:1 mentorship call + his Google interview cheat sheet (only 30 spots):\nhttps://lnkd.in/gsqgT7C4\n\nLearn smart. Prepare with direction.\nIt makes all the difference.",
        "engagement": 592,
        "line_count": 23,
        "language": "English",
        "tags": [
            "Career Advice",
            "Software Engineering",
            "Interviews",
            "Coding"
        ]
    },
    {
        "text": "🌟 Looking for Senior Talent!\n\nAt Kanerika Inc, we believe great teams build great products. And now, we’re growing even bigger!\n\nWe’re on the lookout for senior professionals across these roles:\n\nSenior Java Developer – 5+ years\nPrincipal Engineer - Java – 10+ years\nTechnical Lead Java - 8+ Years\nLooking for Immediate joiners\n\n👉 Know someone ready for a new challenge? Refer them today! Your referral could help someone land their dream job.\n\n📧 Resumes welcomed at: talent.acquisition@kanerika.com\n💼 Join a dynamic team where your expertise matters.\nLet’s grow together. 🚀",
        "engagement": 15,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Career",
            "Recruitment",
            "Job Search",
            "Company",
            "Programming"
        ]
    },
    {
        "text": "Kuch acha nahi lag raha tha…\n\nLife se disconnected sa mehsoos kar raha tha.\nJo karna chahta tha, vo sab ho hi nahi raha tha.\nSara din memes dekhta aur banata tha—pehle khush rehta tha, par ab vo bhi maza nahi aa raha tha.\n\nFir kahin se apne mahaule me Hinglish™ ki entry hui.\nOho oh oh, oho oh oh oh\n\nFirse khud se connected mehsoos kiya.\nJo bhi andar daba pada tha, sab umad ke nikalne laga.\n\nPhir ek din, Shubham Gune Ustaad ji se mulaqat hui.\nUnhone kaha, \"Tumse bohot umeed hai mujhe.\"\nAur bas, samajh aa gaya... mera rasta Hinglish™ se hai.\n\nI understood the art of crafting.\nHow words don’t just tell stories, they make people feel them.\nHow humor and emotions, when blended just right, create an instant connection.\n\nAb sirf khud ki kahani nahi likhni… brands ki bhi likhni hai.\n\nSpecial thanks to Megha Prasad & Jenil Chavda",
        "engagement": 219,
        "line_count": 17,
        "language": "Hinglish",
        "tags": [
            "Humor",
            "Storytelling",
            "Motivation",
            "Self Improvement",
            "Language"
        ]
    },
    {
        "text": "Someone, why do you post most of the content in Hindi?\n\nMe: Bhai, this is neither proper Hindi nor proper English; it is Hinglish. (I just feel more comfortable expressing myself in Hinglish.)\n\nWhat's your take on this??\n\nDoes this language thing really matter here?",
        "engagement": 11,
        "line_count": 5,
        "language": "Hinglish",
        "tags": [
            "Self Expression",
            "Language",
            "Communication"
        ]
    }
]